常见的MySQL函数。

### 字符串相关函数：
- char_length()  获取字符串长度，相当于len
- concat  字符串拼接
- concat_ws 字符串拼接with separator
- group_concat  组拼接，用于group by
- format 国际金融格式100,000,000.00
- insert 从指定位置插入指定的字符串，相当于replace
- locate  定位最早的匹配的字符串的所在位置
- lcase  小写化
- ucase  大写化
- left  取左
- right 取右
- trim，ltrim，rtrim 去除空格
- replace 替换
- reverse 反向
- substring 截取子字符串

### 数字函数
- ceil
- floor
- max
- min
- count
- avg
- abs
- sum
### 时间类函数
- now()
- current_date
- current_time
- systime()
- date
- year
- month
- day
- time
- adddate(now(), interval 1 Hour)
- subdate(now(), interval 2 Day)
- date_format(now(), '%Y-%m-%d-%r')
- date_format(now(), '%Y-%m-%d %H:%i:%s')

### 条件语句
- if
- ifnull
- isnull
- case

## 一、字符串函数

### 1. char_length(str)
返回字符串长度。从结果来看，空格也算长度。如果字符串是null，则返回null。

mysql> select char_length('this is a string.') as length; 
+--------+
| length |
+--------+
|     17 |
+--------+
1 row in set (0.00 sec)

### 2. concat(str1, str2, ...)
连接字符串。
如果有任意字符串为null，那么返回结果为null。

mysql> select concat('1992','-','01','-','01') as c;
+------------+
| c          |
+------------+
| 1992-01-01 |
+------------+
1 row in set (0.00 sec)

mysql> select concat('str1',null) as n;
+------+
| n    |
+------+
| NULL |
+------+
1 row in set (0.00 sec)

### 3. concat_ws(separator,str1,str2,...)
全称就是concat_with_seperation，指定分隔字符串拼接字符串。

mysql> select concat_ws('-',1992,01,01) as d;
+----------+
| d        |
+----------+
| 1992-1-1 |
+----------+
1 row in set (0.00 sec)

如果有任意字符串为null，则忽略掉这个null。

mysql> select concat_ws('-',1992,01,null) as d;  
+--------+
| d      |
+--------+
| 1992-1 |
+--------+
1 row in set (0.00 sec)

### 4. group_concat (column_name)
可以用于group by查看一些不能合并的列的值。

mysql> SELECT student_name,
    ->     GROUP_CONCAT(test_score)
    ->     FROM student
    ->     GROUP BY student_name;

mysql> select student_id,group_concat(num) from score group by student_id;
+------------+-------------------+
| student_id | group_concat(num) |
+------------+-------------------+
|          1 | 10,9,66           |
|          2 | 8,65,68,99        |
|          3 | 77,66,87,99       |
|          4 | 79,11,67,100      |
|          5 | 79,11,67,100      |
|          6 | 9,100,67,100      |
|          7 | 9,100,67,88       |
|          8 | 9,100,67,88       |
|          9 | 91,88,67,22       |
|         10 | 90,77,43,87       |
|         11 | 90,77,43,87       |
|         12 | 90,77,43,87       |
|         13 | 65,87             |
|         14 | 65                |
|         15 | 65                |
|         16 | 65                |
+------------+-------------------+
16 rows in set (0.00 sec)

### 5. FORMAT(X,D[,locale])
国际化金额函数。
把数字或者数字字符串，转为国际化的格式，并且还能保留小数位。

mysql> select format('1245566.75325',2);
+---------------------------+
| format('1245566.75325',2) |
+---------------------------+
| 1,245,566.75              |
+---------------------------+
1 row in set (0.00 sec)

参数x为数值或字符串格式的数值，d为小数位（rounded四舍五入），

locale参数为

The optional third parameter enables a locale to be specified to be
used for the result number's decimal point, thousands separator, and
grouping between separators. Permissible locale values are the same as
the legal values for the lc_time_names system variable (see
http://dev.mysql.com/doc/refman/5.5/en/locale-support.html). If no
locale is specified, the default is 'en_US'.

Examples:
mysql> SELECT FORMAT(12332.123456, 4);
        -> '12,332.1235'
mysql> SELECT FORMAT(12332.1,4);
        -> '12,332.1000'
mysql> SELECT FORMAT(12332.2,0);
        -> '12,332'
mysql> SELECT FORMAT(12332.2,2,'de_DE');
        -> '12.332,20'

### 6. insert(str, start,end, sub_str)
字符串替换。把给定字符串从【start, end】替换为给定字符串。

mysql> select insert('XIAO da yu',1,5,'xxxx-') as name; 
+------------+
| name       |
+------------+
| xxxx-da yu |
+------------+
1 row in set (0.00 sec)

就是将XIAO da yu的第1位到第5位，替换成xxxx-。

### 7. LOCATE(substr,str), LOCATE(substr,str,pos)
字符串定位。某个字符串首次出现的位置。有null运算返回null。

Examples:
mysql> SELECT LOCATE('bar', 'foobarbar');
        -> 4
mysql> SELECT LOCATE('xbar', 'foobar');
        -> 0
mysql> SELECT LOCATE('bar', 'foobarbar', 5);
        -> 7

mysql> select locate('da','xiao da yu');
+---------------------------+
| locate('da','xiao da yu') |
+---------------------------+
|                         6 |
+---------------------------+
1 row in set (0.00 sec)

mysql> select insert ('从头开始学mysql',locate('mysql','从头开始学mysql'),char_length('mysql'),'MySQL') as blogName;
+----------------------+
| blogName             |
+----------------------+
| 从头开始学MySQL      |
+----------------------+
1 row in set (0.00 sec)

首先要定位到"mysql"的开始位置，然后计算出"mysql"的长度。最后用"MySQL"替换"mysql"。

### 8. LCASE(str)
将字符串小写化。

mysql> select lcase('MYSQL') as lower;
+-------+
| lower |
+-------+
| mysql |
+-------+
1 row in set (0.00 sec)

### 8. UCASE(str)
将字符串大写化。

mysql> select ucase('mysql') as upper; 
+-------+
| upper |
+-------+
| MYSQL |
+-------+
1 row in set (0.00 sec)

### 9. LEFT(str,len)

从左侧取字符串的指定长度。

mysql> select left('mysql',2) as f12;
+-----+
| f12 |
+-----+
| my  |
+-----+
1 row in set (0.00 sec)

### 10. right(str, len)

从字符串右侧取指定长度。

mysql> select right('mysql',3) as last;
+------+
| last |
+------+
| sql  |
+------+
1 row in set (0.00 sec)

### 11. TRIM, LTRIM, RTRIM 
去除首位空格。  
- TRIM去掉两边的空格；
- LTRM去掉左边的空格；
- RTRIM去掉右边空格。

mysql> SELECT TRIM('  bar   ');
        -> 'bar'
mysql> SELECT TRIM(LEADING 'x' FROM 'xxxbarxxx');
        -> 'barxxx'
mysql> SELECT TRIM(BOTH 'x' FROM 'xxxbarxxx');
        -> 'bar'
mysql> SELECT TRIM(TRAILING 'xyz' FROM 'barxxyz');
        -> 'barx'

### 12. replace(str, find_str, re_str)
替换

mysql> select replace('Mysql','sql','SQL') as result;
+--------+
| result |
+--------+
| MySQL  |
+--------+
1 row in set (0.00 sec)

### 13. REVERSE(str)
反转

mysql> select reverse('abcdefg');
+--------------------+
| reverse('abcdefg') |
+--------------------+
| gfedcba            |
+--------------------+
1 row in set (0.00 sec)

### 14. substring 
截取
- SUBSTRING(str,pos), 
- SUBSTRING(str FROM pos), 
- SUBSTRING(str,pos,len),
- SUBSTRING(str FROM pos FOR len)

mysql> SELECT SUBSTRING('Quadratically',5);
        -> 'ratically'
mysql> SELECT SUBSTRING('foobarbar' FROM 4);
        -> 'barbar'
mysql> SELECT SUBSTRING('Quadratically',5,6);
        -> 'ratica'
mysql> SELECT SUBSTRING('Sakila', -3);
        -> 'ila'
mysql> SELECT SUBSTRING('Sakila', -5, 3);
        -> 'aki'
mysql> SELECT SUBSTRING('Sakila' FROM -4 FOR 2);
        -> 'ki'

---

## 二、数字函数

- ceil
- floor
- max
- min
- count
- avg
- abs
- sum